eisup_2019_docmng_integration/src/Documents/ttk_НастройкаСоответствияКонтрагентовЕИСУПиВГО/ttk_НастройкаСоответствияКонтрагентовЕИСУПиВГО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ttk_НастройкаСоответствияКонтрагентовЕИСУПиВГО</name>
  <registerRecords>InformationRegister.ttk_СоответствиеКонтрагентовЕИСУПиВГО</registerRecords>
  <attributes>
    <name>ПричинаИзмененияСтатуса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыПервичныхДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоответствиеКонтрагентов</name>
    <attributes>
      <name>КонтрагентЕИСУП</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорЕИСУП</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтрагентВГО</name>
      <type>
        <types>CatalogRef.ttk_КонтрагентыВГО</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/InformationRegisters/абс_ИзменениеСтатусовПервичныхДокументов/абс_ИзменениеСтатусовПервичныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ИзменениеСтатусовПервичныхДокументов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьОтветственного</name>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнутреннийНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ПервичныйДокумент</name>
    <type>
      <types>DocumentRef.ОприходованиеТоваров</types>
      <types>DocumentRef.ttk_УстановкаСоответствияНоменклатурыБюджетнымАналитикам</types>
      <types>DocumentRef.АктОбОказанииПроизводственныхУслуг</types>
      <types>DocumentRef.kwr_ИнтеграцияСHyperion</types>
      <types>DocumentRef.ttk_ЗагрузкаНачисленийИзБиллинга</types>
      <types>DocumentRef.ttk_НастройкаСоответствияСчетовБУКСтатьямВГО</types>
      <types>DocumentRef.ТребованиеНакладная</types>
      <types>DocumentRef.ttk_ДекларацияБиллинг</types>
      <types>DocumentRef.абс_НеотфактурованнаяПоставка</types>
      <types>DocumentRef.ttk_НастройкаСоответствияКонтрагентовЕИСУПиВГО</types>
      <types>DocumentRef.ПередачаТоваров</types>
      <types>DocumentRef.ttk_РаспоряжениеНаЗакупку</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ВозвратПереданныхТоваров</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.КорректировкаПоступления</types>
      <types>DocumentRef.ttk_ПроектКорректировкиДога</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.ttk_ОтражениеСтатейБюджетаВРазделыПланаПлатежей</types>
      <types>DocumentRef.ttk_СверкаВГО</types>
      <types>DocumentRef.КорректировкаРеализации</types>
      <types>DocumentRef.Абс_АктПриёмкиВыполненныхРабот</types>
      <types>DocumentRef.КомплектацияНоменклатуры</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.СписаниеТоваров</types>
      <types>DocumentRef.ПолучениеУслугПоПереработке</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.абс_СтатусыПервичныхДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/ttk_СоответствиеКонтрагентовЕИСУПиВГО/ttk_СоответствиеКонтрагентовЕИСУПиВГО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ttk_СоответствиеКонтрагентовЕИСУПиВГО</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>КонтрагентВГО</name>
    <type>
      <types>CatalogRef.ttk_КонтрагентыВГО</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КонтрагентЕИСУП</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорЕИСУП</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/абс_СтатусыПервичныхДокументов/абс_СтатусыПервичныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыПервичныхДокументов</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеОФК</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаБухгалтером</name>
  </enumValues>
  <enumValues>
    <name>ДокументыПринятыБухгалтером</name>
    <comment>Обработка принятых документов (до оптимизации 2018)</comment>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
  </enumValues>
  <enumValues>
    <name>УточнениеОФК</name>
  </enumValues>
  <enumValues>
    <name>УточнениеБухгалтерией</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаДокумента</name>
  </enumValues>
  <enumValues>
    <name>Отмена</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеРП_Источник</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеРП_Приемник</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДиректоромДирекции</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаДанных</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаДанных</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДК</name>
    <comment>Департамент казначейства</comment>
  </enumValues>
  <enumValues>
    <name>СогласованиеОЭФ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеЭкономистомКЦ</name>
  </enumValues>
  <enumValues>
    <name>БюджетныйКонтроль</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПДД</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Documents/ttk_НастройкаСоответствияКонтрагентовЕИСУПиВГО/ObjectModule.bsl
Процедура ПриЗаписи(Отказ)
	
	ТекПользователь = глЗначениеПеременной("глТекущийПользователь");
	
	НаборЗаписей = РегистрыСведений.абс_ИзменениеСтатусовПервичныхДокументов.СоздатьНаборЗаписей();	
	НаборЗаписей.Отбор.ПервичныйДокумент.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	
	Запись = НаборЗаписей.Добавить();
	Запись.Период = абс_СерверныеФункции.ПолучитьДатуСервера();
	Запись.ПервичныйДокумент = Ссылка;
	Запись.Пользователь = ТекПользователь;	
	Запись.СтатусДокумента = Статус;	
	Запись.Комментарий = Комментарий;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда
		Статус = Перечисления.абс_СтатусыПервичныхДокументов.Подготовка;
		Ответственный = глЗначениеПеременной("глТекущийПользователь");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Дата = ТекущаяДата();
	Статус = Перечисления.абс_СтатусыПервичныхДокументов.Подготовка;
	Комментарий = "";
	Ответственный = глЗначениеПеременной("глТекущийПользователь");
	СоответствиеКонтрагентов.Очистить();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Статус = Перечисления.абс_СтатусыПервичныхДокументов.Согласован Тогда
		Движения.ttk_СоответствиеКонтрагентовЕИСУПиВГО.Записывать = Истина;
		Движения.ttk_СоответствиеКонтрагентовЕИСУПиВГО.Очистить();
		Для Каждого ТекСтрокаСоответствиеКонтрагентов Из СоответствиеКонтрагентов Цикл
			Движение = Движения.ttk_СоответствиеКонтрагентовЕИСУПиВГО.Добавить();
			Движение.Организация = Организация;
			Движение.КонтрагентЕИСУП = ТекСтрокаСоответствиеКонтрагентов.КонтрагентЕИСУП;
			Движение.ДоговорЕИСУП = ТекСтрокаСоответствиеКонтрагентов.ДоговорЕИСУП;
			Движение.КонтрагентВГО = ТекСтрокаСоответствиеКонтрагентов.КонтрагентВГО;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Или Статус = Перечисления.абс_СтатусыПервичныхДокументов.Отмена Тогда
		Статус = Перечисления.абс_СтатусыПервичныхДокументов.Отмена;
		РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения;
	КонецЕсли;
	
КонецПроцедуры
